cases/multiphaseEjector/Euler_OF13/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inletMain
    {
        type            patch;
        nFaces          10;
        startFace       19654;
    }
    outlet
    {
        type            patch;
        nFaces          28;
        startFace       19664;
    }
    inletSecondary
    {
        type            patch;
        nFaces          8;
        startFace       19692;
    }
    wallNozzle1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          233;
        startFace       19700;
    }
    wallNozzle2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          379;
        startFace       19933;
    }
    wallDiffuser
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          144;
        startFace       20312;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          10134;
        startFace       20456;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          10134;
        startFace       30590;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          0;
        startFace       40724;
    }
)

// ************************************************************************* //
