cases/multiphaseEjector/Euler_OF13/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices        ( ( 0 0 -0.1 ) ( 92.72 0 -0.1 ) ( 380 0 -0.1 ) ( 406.07 0 -0.1 ) ( 491.07 0 -0.1 ) ( 561.07 0 -0.1 ) ( 741.07 0 -0.1 ) ( 491.07 4.2 -0.1 ) ( 561.07 4.2 -0.1 ) ( 491.07 5.25 -0.1 ) ( 561.07 5.25 -0.1 ) ( 380 7 -0.1 ) ( 406.07 7 -0.1 ) ( 378.74 9.46 -0.1 ) ( 406.07 9.46 -0.1 ) ( 491.32 10.5 -0.1 ) ( 561.195 10.5 -0.1 ) ( 363.928 11.485 -0.1 ) ( 741.07 12 -0.1 ) ( 741.07 15 -0.1 ) ( 279.996 22.96 -0.1 ) ( 407.957 23.835 -0.1 ) ( 386.521 27.264 -0.1 ) ( 372.23 29.55 -0.1 ) ( 741.07 30 -0.1 ) ( 0 40 -0.1 ) ( 92.72 40 -0.1 ) ( 144.501 41.4846 -0.1 ) ( 131.88 43.21 -0.1 ) ( 131.88 57.05 -0.1 ) ( 145.903 57.05 -0.1 ) ( 292.63 57.05 -0.1 ) ( 0 0 0 ) ( 92.72 0 0 ) ( 380 0 0 ) ( 406.07 0 0 ) ( 491.07 0 0 ) ( 561.07 0 0 ) ( 741.07 0 0 ) ( 491.07 4.2 0 ) ( 561.07 4.2 0 ) ( 491.07 5.25 0 ) ( 561.07 5.25 0 ) ( 380 7 0 ) ( 406.07 7 0 ) ( 378.74 9.46 0 ) ( 406.07 9.46 0 ) ( 491.32 10.5 0 ) ( 561.195 10.5 0 ) ( 363.928 11.485 0 ) ( 741.07 12 0 ) ( 741.07 15 0 ) ( 279.996 22.96 0 ) ( 407.957 23.835 0 ) ( 386.521 27.264 0 ) ( 372.23 29.55 0 ) ( 741.07 30 0 ) ( 0 40 0 ) ( 92.72 40 0 ) ( 144.501 41.4846 0 ) ( 131.88 43.21 0 ) ( 131.88 57.05 0 ) ( 145.903 57.05 0 ) ( 292.63 57.05 0 ) );

edges           ( );

blocks          ( hex ( 0 1 26 25 32 33 58 57 ) fluid ( 53 10 1 ) simpleGrading ( 1 1 1 ) hex ( 1 2 11 26 33 34 43 58 ) fluid ( 165 10 1 ) simpleGrading ( 1 1 1 ) hex ( 2 3 12 11 34 35 44 43 ) fluid ( 15 10 1 ) simpleGrading ( 1 1 1 ) hex ( 27 20 31 30 59 52 63 62 ) fluid ( 81 15 1 ) simpleGrading ( 1 1 1 ) hex ( 20 17 23 31 52 49 55 63 ) fluid ( 49 15 1 ) simpleGrading ( 1 1 1 ) hex ( 17 13 22 23 49 45 54 55 ) fluid ( 8 15 1 ) simpleGrading ( 1 1 1 ) hex ( 13 14 21 22 45 46 53 54 ) fluid ( 14 15 1 ) simpleGrading ( 1 1 1 ) hex ( 3 4 7 12 35 36 39 44 ) fluid ( 49 10 1 ) simpleGrading ( 1 1 1 ) hex ( 12 7 9 14 44 39 41 46 ) fluid ( 49 3 1 ) simpleGrading ( 1 1 1 ) hex ( 14 9 15 21 46 41 47 53 ) fluid ( 49 15 1 ) simpleGrading ( 1 1 1 ) hex ( 4 5 8 7 36 37 40 39 ) fluid ( 40 10 1 ) simpleGrading ( 1 1 1 ) hex ( 7 8 10 9 39 40 42 41 ) fluid ( 40 3 1 ) simpleGrading ( 1 1 1 ) hex ( 9 10 16 15 41 42 48 47 ) fluid ( 40 15 1 ) simpleGrading ( 1 1 1 ) hex ( 5 6 18 8 37 38 50 40 ) fluid ( 104 10 1 ) simpleGrading ( 1 1 1 ) hex ( 8 18 19 10 40 50 51 42 ) fluid ( 104 3 1 ) simpleGrading ( 1 1 1 ) hex ( 10 19 24 16 42 51 56 48 ) fluid ( 104 15 1 ) simpleGrading ( 1 1 1 ) hex ( 28 27 30 29 60 59 62 61 ) fluid ( 8 15 1 ) simpleGrading ( 1 1 1 ) );

boundary        ( inletMain { type patch ; faces ( ( 0 32 57 25 ) ) ; } outlet { type patch ; faces ( ( 6 18 50 38 ) ( 18 19 51 50 ) ( 19 24 56 51 ) ) ; } inletSecondary { type patch ; faces ( ( 30 29 61 62 ) ) ; } wallNozzle1 { type wall ; faces ( ( 26 25 57 58 ) ( 11 26 58 43 ) ( 12 11 43 44 ) ) ; } wallNozzle2 { type wall ; faces ( ( 27 20 52 59 ) ( 20 17 49 52 ) ( 17 13 45 49 ) ( 13 14 46 45 ) ( 28 27 59 60 ) ( 31 30 62 63 ) ( 23 31 63 55 ) ( 22 23 55 54 ) ( 21 22 54 53 ) ( 15 21 53 47 ) ( 28 60 61 29 ) ( 12 44 46 14 ) ) ; } wallDiffuser { type wall ; faces ( ( 16 15 47 48 ) ( 24 16 48 56 ) ) ; } front { type symmetry ; faces ( ( 32 33 58 57 ) ( 33 34 43 58 ) ( 34 35 44 43 ) ( 59 52 63 62 ) ( 52 49 55 63 ) ( 49 45 54 55 ) ( 45 46 53 54 ) ( 35 36 39 44 ) ( 44 39 41 46 ) ( 46 41 47 53 ) ( 36 37 40 39 ) ( 39 40 42 41 ) ( 41 42 48 47 ) ( 37 38 50 40 ) ( 40 50 51 42 ) ( 42 51 56 48 ) ( 60 59 62 61 ) ) ; } back { type symmetry ; faces ( ( 0 25 26 1 ) ( 1 26 11 2 ) ( 2 11 12 3 ) ( 27 30 31 20 ) ( 20 31 23 17 ) ( 17 23 22 13 ) ( 13 22 21 14 ) ( 3 12 7 4 ) ( 12 14 9 7 ) ( 14 21 15 9 ) ( 4 7 8 5 ) ( 7 9 10 8 ) ( 9 15 16 10 ) ( 5 8 18 6 ) ( 8 10 19 18 ) ( 10 16 24 19 ) ( 28 29 30 27 ) ) ; } );

mergePatchPairs ( );

defaultPatch
{
    type            wall;
    name            walls;
}

scale           0.001;


// ************************************************************************* //
