cases/multiphaseEjector/Euler_OF13/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 3;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0;
    }

    p_rghFinal
    {
	$p_rgh;
        relTol          0;
    }

    "U.*"
    {
        solver          smoothSolver;
	smoother 	symGaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
        minIter         1;
    }

    "e.*"
    {
        solver          smoothSolver;
	smoother	symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        minIter         1;
    }

    "(k|epsilon|omega|Theta).*"
    {
        solver          smoothSolver;;
        smoother	symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        minIter         1;
    }

    "Yi.*"
    {
        solver          smoothSolver;
        smoother	symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        minIter         1;
        residualAlpha   1e-08;
    }


}

PIMPLE
{
    nOuterCorrectors 3;
    nCorrectors      1;
    nNonOrthogonalCorrectors 2;
    faceMomentum     no;
    nEnergyCorrectors	1;
/*    residualControl
    {
        "(U|e|h|k|epsilon|omega).*"	0.0001;
        "p_rgh"				0.0001;
    }*/

}

relaxationFactors
{
    fields
    {
	p_rgh		0.3;
	"U.*"           0.7;
        "alpha.*"       0.5;
    }

    equations
    {
        ".*"            1;
	"e.*"		0.2;
	"k.*"		0.2;
	"epsilon.*"	0.4;
	"omega.*"	0.2;
    }
}


// ************************************************************************* //
