cases/multiphaseEjector/Euler_OF13/system/patchAverageSecondary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the average values of fields on a patch.

\*---------------------------------------------------------------------------*/

patch   inletSecondary;

fields  (p);

operation areaAverage;

#includeEtc "caseDicts/postProcessing/surfaceFieldValue/patchValue.cfg"

// ************************************************************************* //
